[
    {
        "food_name": "Spaghetti Bolognese",
        "image": "https://i.ibb.co/9NrSsry/clark-douglas-k8-FXgs-DTm8g-unsplash.jpg",
        "category": "Pasta",
        "price": 12.99,
        "madeBy": "author",
        "quantity": 20,
        "origin": "Italy",
        "description": "Classic Italian pasta dish with a rich meat sauce.",
        "ingredients": "Ground beef, spaghetti, tomatoes, onions, garlic, spices",
        "making": "Brown ground beef, sauté onions and garlic, add tomatoes and spices, simmer, and serve over cooked spaghetti.",
        "procedure": "1. Cook spaghetti. 2. Brown ground beef. 3. Sauté onions and garlic. 4. Add tomatoes and spices. 5. Simmer for a flavorful sauce. 6. Serve sauce over cooked spaghetti."
    },
    {
        "food_name": "Cheeseburger",
        "image": "https://i.ibb.co/H4gDcCb/fast-food-table-144627-16489.jpg",
        "category": "Burger",
        "price": 8.49,
        "origin": "United States",
        "description": "Classic American burger with a juicy patty and cheese.",
        "ingredients": "Ground beef patty, cheese, bun, lettuce, tomato, onion, ketchup, spices",
        "making": "Grill beef patty, melt cheese, assemble with fresh veggies and bun, and add a touch of ketchup.",
        "procedure": "1. Grill the beef patty to perfection. 2. Melt cheese on the patty. 3. Assemble with fresh lettuce, tomato, onion, and a soft bun. 4. Add a touch of ketchup for extra flavor. 5. Serve."
    },
    {
        "food_name": "Margherita Pizza",
        "image": "https://i.ibb.co/XZTcgFC/freshly-baked-pizza-rustic-wooden-table-generated-by-ai-24640-89802.jpg",
        "category": "Pizza",
        "price": 10.99,
        "origin": "Italy",
        "description": "Traditional Italian pizza with a simple yet delicious combination of ingredients.",
        "ingredients": "Pizza dough, tomatoes, fresh mozzarella, basil, olive oil, salt",
        "making": "Roll out pizza dough, top with sliced tomatoes, fresh mozzarella, and basil leaves, drizzle with olive oil, and bake until crispy.",
        "procedure": "1. Roll out pizza dough into a thin crust. 2. Top with sliced tomatoes. 3. Add slices of fresh mozzarella. 4. Sprinkle with fresh basil leaves. 5. Drizzle with olive oil and a pinch of salt. 6. Bake until the crust is crispy and the cheese is bubbly. 7. Slice and serve."
    },
    {
        "food_name": "Caesar Salad",
        "image": "https://i.ibb.co/jR0MLQD/top-view-caesar-salad-oval-plate-green-white-checkered-tablecloth-fork-knife-dark-red-background-140.jpg",
        "category": "Salad",
        "price": 7.99,
        "origin": "United States",
        "description": "A classic Caesar salad with crisp lettuce, croutons, and a creamy dressing.",
        "ingredients": "Romaine lettuce, croutons, Parmesan cheese, Caesar dressing",
        "making": "Toss fresh Romaine lettuce with Caesar dressing, add crunchy croutons and Parmesan cheese, and serve as a refreshing salad.",
        "procedure": "1. Wash and chop fresh Romaine lettuce. 2. Toss the lettuce with Caesar dressing until evenly coated. 3. Add crunchy croutons. 4. Sprinkle with grated Parmesan cheese. 5. Serve as a side or main dish."
    },
    {
        "food_name": " Platter",
        "image": "https://i.ibb.co/rt4bhFs/painting-sushi-plate-with-picture-fish-it-188544-12221.jpg",
        "category": "Soup",
        "price": 18.99,
        "origin": "Japan",
        "description": "An assortment of fresh sushi, including nigiri and maki rolls.",
        "ingredients": "Sushi rice, fresh fish (e.g., tuna, salmon), seaweed, soy sauce, wasabi, pickled ginger",
        "making": "Roll sushi rice and fresh fish in seaweed, slice into bite-sized pieces, and serve with soy sauce, wasabi, and pickled ginger.",
        "procedure": "1. Prepare sushi rice and season it. 2. Lay out a sheet of seaweed. 3. Add a layer of sushi rice and top with fresh fish. 4. Roll the sushi and slice it into bite-sized pieces. 5. Serve with soy sauce, wasabi, and pickled ginger for dipping."
    },
    {
        "food_name": "Chicken",
        "image": "https://i.ibb.co/M7Ddzgw/freshly-cooked-gourmet-meal-ready-eat-generated-by-ai-24640-81613.jpg",
        "category": "Pasta",
        "price": 14.99,
        "origin": "Italy",
        "description": "Creamy Alfredo pasta with tender chicken pieces.",
        "ingredients": "Chicken breast, fettuccine, Alfredo sauce, garlic, Parmesan cheese",
        "making": "Cook chicken breast, prepare Alfredo sauce with garlic and Parmesan, combine with cooked fettuccine, and garnish with more Parmesan cheese.",
        "procedure": "1. Grill or pan-fry chicken breast until cooked through. 2. Cook fettuccine until al dente. 3. In a separate pan, heat the Alfredo sauce and add minced garlic. 4. Combine the cooked chicken, fettuccine, and Alfredo sauce. 5. Garnish with grated Parmesan cheese. 6. Serve as a creamy and indulgent pasta dish."
    },
    {
        "food_name": "Club Sandwich",
        "image": "https://i.ibb.co/7k7rsyR/front-view-tasty-ham-sandwiches-with-french-fries-dark-surface-179666-34644.jpg",
        "category": "Burger",
        "price": 9.99,
        "origin": "United States",
        "description": "A classic club sandwich with layers of turkey, bacon, lettuce, tomato, and mayonnaise.",
        "ingredients": "Turkey, bacon, lettuce, tomato, bread, mayonnaise, toothpicks",
        "making": "Layer turkey, bacon, lettuce, and tomato between slices of bread, secure with toothpicks, and serve with mayonnaise.",
        "procedure": "1. Toast slices of bread until lightly browned. 2. Spread mayonnaise on one side of each slice. 3. Layer turkey, bacon, lettuce, and tomato between slices. 4. Cut the sandwich into quarters and secure each quarter with toothpicks. 5. Serve as a classic club sandwich."
    },
    {
        "food_name": "Beef Stir-Fry",
        "image": "https://i.ibb.co/jRqsKRJ/stir-fry-chicken-sweet-peppers-green-beans-2829-20110.jpg",
        "category": "Tacos",
        "price": 13.49,
        "origin": "Various",
        "description": "A flavorful beef stir-fry with mixed vegetables and a savory sauce.",
        "ingredients": "Beef strips, mixed vegetables (e.g., bell peppers, broccoli), soy sauce, garlic, ginger, rice",
        "making": "Stir-fry beef and vegetables in a hot wok, add soy sauce, garlic, and ginger, and serve over steamed rice.",
        "procedure": "1. Heat a wok or large skillet over high heat. 2. Stir-fry sliced beef until browned. 3. Add mixed vegetables and stir-fry until tender. 4. Mix in soy sauce, minced garlic, and grated ginger. 5. Serve over steamed rice."
    },
    {
        "food_name": "Chicken Tacos",
        "image": "https://i.ibb.co/RYpgTyh/side-view-baked-chicken-with-cucumber-lemon-seasoning-bread-table.jpg",
        "category": "Tacos",
        "price": 10.99,
        "origin": "Mexico",
        "description": "Tasty chicken tacos with a variety of toppings and seasonings.",
        "ingredients": "Chicken, tortillas, salsa, lettuce, cheese, sour cream, spices",
        "making": "Cook seasoned chicken, warm tortillas, assemble tacos with chicken and your choice of toppings, and enjoy.",
        "procedure": "1. Season and cook chicken until done. 2. Heat tortillas. 3. Assemble tacos with chicken, salsa, lettuce, cheese, sour cream, and your favorite spices. 4. Savor the delicious combination of flavors."
    },
    {
        "food_name": "Vegetable Curry",
        "image": "https://i.ibb.co/JxHR4JZ/front-view-tasty-vegetable-salad-inside-plate-blue-table-140725-137125.jpg",
        "category": "Curry",
        "price": 11.99,
        "origin": "India",
        "description": "A fragrant vegetable curry with a blend of spices and herbs.",
        "ingredients": "Mixed vegetables (e.g., potatoes, carrots, peas), curry spices, tomatoes, coconut milk, rice",
        "making": "Sauté vegetables and spices, add tomatoes and coconut milk, simmer until tender, and serve with rice.",
        "procedure": "1. Sauté mixed vegetables with curry spices in a pot. 2. Stir in diced tomatoes and coconut milk. 3. Simmer until the vegetables are tender and the curry is fragrant. 4. Serve with steamed rice for a satisfying meal."
    },
    {
        "food_name": " Risotto",
        "image": "https://i.ibb.co/hcmkxsq/fettuccine-pasta-chicken-mushroom-parmesan-tomato-mint-sumakh-cocktail-side-view-141793-2364.jpg",
        "category": "Risotto",
        "price": 12.99,
        "origin": "Italy",
        "description": "Creamy mushroom risotto with Arborio rice and Parmesan cheese.",
        "ingredients": "Arborio rice, mushrooms, onion, chicken broth, white wine, Parmesan cheese",
        "making": "Sauté rice, mushrooms, and onion, add white wine and broth, stir until creamy, and finish with Parmesan cheese.",
        "procedure": "1. Sauté Arborio rice, mushrooms, and chopped onion in a large pan. 2. Pour in white wine and stir until absorbed. 3. Gradually add hot chicken broth, stirring until the rice is creamy. 4. Finish with grated Parmesan cheese. 5. Serve as a comforting and indulgent dish."
    },
    {
        "food_name": "Fruit Salad",
        "image": "https://i.ibb.co/gjYDfXb/top-view-delicious-fruit-salad-inside-plate-with-fresh-fruits-gray-fruit-tree-exotic-tropical-photo.jpg",
        "category": "Salad",
        "price": 6.99,
        "origin": "Various",
        "description": "A refreshing fruit salad with a variety of fresh fruits.",
        "ingredients": "Assorted fruits (e.g., strawberries, melon, grapes, kiwi), honey, lemon juice, mint leaves",
        "making": "Cut and combine assorted fruits, drizzle with honey and lemon juice, garnish with fresh mint leaves, and serve as a healthy dessert.",
        "procedure": "1. Wash and chop a variety of fresh fruits into bite-sized pieces. 2. Combine the fruits in a large bowl. 3. Drizzle with honey and fresh lemon juice. 4. Toss to coat. 5. Garnish with fresh mint leaves. 6. Enjoy as a refreshing and healthy dessert."
    },
    {
        "food_name": "Beef Tacos",
        "image": "https://i.ibb.co/0Jf4sy9/grilled-beef-taco-with-fresh-guacamole-cilantro-generated-by-ai-188544-43106.jpg",
        "category": "Tacos",
        "price": 11.49,
        "origin": "Mexico",
        "description": "Savory beef tacos with your choice of toppings and a hint of spice.",
        "ingredients": "Ground beef, tortillas, salsa, lettuce, cheese, jalapeños, spices",
        "making": "Cook seasoned ground beef, warm tortillas, assemble tacos with beef and your preferred toppings, and savor the delicious blend of flavors.",
        "procedure": "1. Season and cook ground beef until browned. 2. Heat tortillas. 3. Assemble tacos with beef, salsa, lettuce, cheese, jalapeños, and your favorite spices. 4. Enjoy the satisfying and mildly spicy taste."
    },
    {
        "food_name": "Shrimp Scampi",
        "image": "https://i.ibb.co/z6zPsnr/white-shrimp-salad-with-lettuce-corn-scallions-1150-26938.jpg",
        "category": "Seafood",
        "price": 15.99,
        "origin": "Italy",
        "description": "Lemony shrimp scampi with garlic, white wine, and linguine pasta.",
        "ingredients": "Large shrimp, linguine pasta, butter, garlic, white wine, lemon juice, parsley",
        "making": "Sauté shrimp and garlic in butter, deglaze with white wine and lemon juice, toss with cooked pasta, and garnish with fresh parsley.",
        "procedure": "1. Cook linguine pasta until al dente. 2. Sauté large shrimp and minced garlic in butter. 3. Deglaze with white wine and fresh lemon juice. 4. Toss with cooked pasta. 5. Garnish with fresh parsley. 6. Savor the zesty and seafood-rich flavors."
    },
    {
        "food_name": "Vegetable Lasagna",
        "image": "https://i.ibb.co/FBqqctx/delicious-pasta-tray-23-2150690759.jpg",
        "category": "Pasta",
        "price": 12.99,
        "origin": "Italy",
        "description": "Layered vegetable lasagna with pasta, ricotta cheese, and marinara sauce.",
        "ingredients": "Lasagna noodles, ricotta cheese, zucchini, spinach, marinara sauce, mozzarella cheese",
        "making": "Layer lasagna noodles with ricotta cheese, zucchini, spinach, and marinara sauce, top with mozzarella cheese, and bake until bubbly.",
    },
    {
        "food_name": "Greek Salad",
        "image": "https://i.ibb.co/dcqzW28/front-view-greece-salad-sliced-vegetable-salad-with-tomatoes-cucumbers-white-cheese-olives-inside-wh.jpg",
        "category": "Salad",
        "price": 8.99,
        "origin": "Greece",
        "description": "A fresh Greek salad with tomatoes, cucumbers, feta cheese, and olives.",
        "ingredients": "Tomatoes, cucumbers, feta cheese, olives, red onion, olive oil",
        "making": "Combine fresh ingredients, drizzle with olive oil, and sprinkle with feta cheese.",
        "procedure": "1. Slice tomatoes, cucumbers, and red onion. 2. Combine with olives. 3. Drizzle with olive oil. 4. Sprinkle with crumbled feta cheese."
    },
    {
        "food_name": "Sushi Rolls",
        "image": "https://i.ibb.co/fHjpX9D/sushi-rolls-with-avocado-tempura-covered-with-red-tobiko-141793-2279.jpg",
        "category": "Sushi",
        "price": 16.99,
        "origin": "Japan",
        "description": "Assorted sushi rolls with a variety of fillings and toppings.",
        "ingredients": "Sushi rice, fish, avocado, seaweed, soy sauce, pickled ginger",
        "making": "Roll sushi rice, fish, and avocado in seaweed, slice, and serve with condiments.",
        "procedure": "1. Lay sushi rice, fish, and avocado on seaweed. 2. Roll and slice into pieces. "
    },
    {
        "food_name": "Mushroom Risotto",
        "image": "https://i.ibb.co/zF47TFh/vegetarian-risotto-with-fresh-mushrooms-parmesan-cheese-generated-by-ai-188544-10223.jpg",
        "category": "Risotto",
        "price": 13.99,
        "origin": "Italy",
        "description": "Creamy mushroom risotto with Arborio rice and Parmesan cheese.",
        "ingredients": "Arborio rice, mushrooms, onion, white wine, vegetable broth",
        "making": "Sauté onions, add rice and wine, cook with broth, stir in mushrooms and cheese.",
        "procedure": "1. Sauté chopped onions. 2. Add Arborio rice and white wine. 3. Cook with vegetable broth, stirring. 4. Stir in sautéed mushrooms and Parmesan cheese. 5. Serve creamy risotto."
    },
    {
        "food_name": "Fish and Chips",
        "image": "https://i.ibb.co/stJvCmR/sour-curry-with-snakehead-fish-spicy-garden-hot-pot-thai-food-1150-26407.jpg",
        "category": "Seafood",
        "price": 10.49,
        "origin": "United Kingdom",
        "description": "Classic British dish featuring crispy battered fish and thick-cut chips.",
        "ingredients": "Cod fish, potato chips, batter, malt vinegar",
        "making": "Coat fish in batter, deep-fry until golden, serve with chips and vinegar.",
        "procedure": "1. Coat cod fish in batter. 2. Deep-fry until golden. 3. Serve with potato chips and malt vinegar."
    },
    {
        "food_name": "Gourmet Salad",
        "image": "https://i.ibb.co/9TPBvvg/close-up-shot-delicious-vegan-salad-with-fresh-ingredients-plate-179666-47110-1.jpg",
        "category": "Salad",
        "price": 12.49,
        "origin": "Various",
        "description": "A gourmet salad with an array of fresh, colorful ingredients.",
        "ingredients": "Mixed greens, heirloom tomatoes, goat cheese, candied walnuts",
        "making": "Toss greens with vinaigrette, arrange tomatoes, cheese, and walnuts on top.",
        "procedure": "1. Toss mixed greens with your favorite vinaigrette. 2. Arrange sliced heirloom tomatoes, crumbled goat cheese, and candied walnuts on top. 3. Enjoy."
    },
    {
        "food_name": "Beef Tacos",
        "image": "https://i.ibb.co/NFPV76D/fresh-taco-144627-38297.jpg",
        "category": "Tacos",
        "price": 8.99,
        "origin": "Mexico",
        "description": "Flavorful beef tacos with salsa, guacamole, and a zesty lime crema.",
        "ingredients": "Beef, tortillas, salsa, guacamole, lime crema, lettuce",
        "making": "Season and cook beef, assemble tacos with toppings and lime crema.",
        "procedure": "1. Season and cook beef until browned. 2. Warm tortillas. 3. Assemble tacos with salsa, guacamole, lettuce, and a zesty lime crema. 4. Enjoy."
    },
    {
        "food_name": "Chicken Biryani",
        "image": "https://i.ibb.co/GnrFTq4/gourmet-chicken-biryani-with-steamed-basmati-rice-generated-by-ai-188544-13480.jpg",
        "category": "rice",
        "price": 12.99,
        "origin": "Bangladesh",
        "description": "A flavorful and aromatic chicken biryani with fragrant spices and tender chicken pieces.",
        "ingredients": "Chicken, Basmati rice, onions, tomatoes, yogurt, spices",
        "making": "Marinate chicken, cook with spices, layer with rice, and steam to perfection.",
        "procedure": "1. Marinate chicken in yogurt and spices. 2. Sauté onions and tomatoes. 3. Cook chicken with fragrant spices. 4. Layer with parboiled Basmati rice. 5. Steam until the biryani is perfectly cooked. 6. Serve hot and enjoy the delicious flavors of chicken biryani."
    },
    {
        "food_name": "Chicken Fajitas",
        "image": "https://i.ibb.co/mXmq4VB/freshly-grilled-beef-vegetable-taco-plate-generative-ai-188544-8038.jpg",
        "category": "t",
        "price": 11.99,
        "origin": "Mexico",
        "description": "Sizzling chicken fajitas with bell peppers, onions, and warm tortillas.",
        "ingredients": "Chicken strips, bell peppers, onions, tortillas, fajita seasoning",
        "making": "Sauté chicken and vegetables with fajita seasoning, serve with tortillas.",
        "procedure": "1. Sauté chicken strips, bell peppers, and onions in a hot skillet with fajita seasoning. 2. Serve with warm tortillas and your favorite toppings."
    },
    {
        "food_name": "Veggie Burger",
        "image": "https://i.ibb.co/jRGPWdh/front-view-tasty-chicken-sandwich-with-green-salad-vegetables-inside-plate-wooden-cream-desk-140725.jpg",
        "category": "Burger",
        "price": 9.49,
        "origin": "Various",
        "description": "A vegetarian burger with a flavorful veggie patty and fresh toppings.",
        "ingredients": "Veggie patty, whole wheat bun, lettuce, tomato, pickles",
        "making": "Grill veggie patty, assemble with bun and fresh vegetables.",
        "procedure": "1. Grill the veggie patty. 2. Assemble on a whole wheat bun with lettuce, tomato, and pickles. 3. Enjoy your meatless burger!"
    },
    {
        "food_name": "Latte Coffee Art Paint",
        "image": "https://i.ibb.co/wswS374/close-up-hands-barista-make-latte-coffee-art-paint-1150-12161.jpg",
        "category": "Beverage",
        "price": 4.99,
        "origin": "Various",
        "description": "A creative and visually stunning latte coffee with artistic foam paintings.",
        "ingredients": "Freshly brewed espresso, steamed milk, food coloring",
        "making": "Brew a shot of espresso, steam milk, and use food coloring for artistic foam designs.",
        "procedure": "1. Brew a shot of espresso using your espresso machine. 2. Steam milk until frothy and creamy. 3. Carefully pour the steamed milk into the espresso to create a latte. 4. Use food coloring to create artistic designs on the foam, such as hearts, flowers, or custom artwork. 5. Serve and enjoy your visually stunning Latte Coffee Art Paint."
    },
    {
        "food_name": "Lobster Bisque",
        "image": "https://i.ibb.co/tcpLFmn/close-up-seafood-soup-155003-430.jpg ",
        "category": "Soup",
        "price": 15.99,
        "origin": "France",
        "description": "A creamy and decadent lobster bisque with tender chunks of lobster meat.",
        "ingredients": "Lobster, cream, butter, onions, sherry, herbs",
        "making": "Sauté onions, simmer lobster in a creamy broth with sherry and herbs.",
        "procedure": "1. Sauté chopped onions in butter. 2. Simmer lobster chunks in a creamy broth with sherry and aromatic herbs. 3. Serve your indulgent lobster bisque."
    }
]